# Case 5: Importing & Merging many files (Baby Names Dataset) - Part 2

## Importing one File & Understanding the Data Structure (complex case)

Import Python Pandas package for table processing.

In [1]:
import pandas as pd

Import (read in) the "AK.TXT".

In [2]:
pd.read_csv("AK.TXT")

       AK  F  1910      Mary  14
0      AK  F  1910     Annie  12
1      AK  F  1910      Anna  10
2      AK  F  1910  Margaret   8
3      AK  F  1910     Helen   7
4      AK  F  1910     Elsie   6
...    .. ..   ...       ...  ..
28522  AK  M  2018      Theo   5
28523  AK  M  2018    Thorin   5
28524  AK  M  2018   Trenton   5
28525  AK  M  2018    Victor   5
28526  AK  M  2018      Zion   5

[28527 rows x 5 columns]

We need to provide a column header this time as the first row is not a header in the original file.

In [3]:
pd.read_csv("AK.TXT", header = None, names = ["State", "Gender", "Year", "Name", "Count"])

      State Gender  Year      Name  Count
0        AK      F  1910      Mary     14
1        AK      F  1910     Annie     12
2        AK      F  1910      Anna     10
3        AK      F  1910  Margaret      8
4        AK      F  1910     Helen      7
...     ...    ...   ...       ...    ...
28523    AK      M  2018      Theo      5
28524    AK      M  2018    Thorin      5
28525    AK      M  2018   Trenton      5
28526    AK      M  2018    Victor      5
28527    AK      M  2018      Zion      5

[28528 rows x 5 columns]

# The glob module

The glob module, Python library, allows us to handle multiple files.

In [5]:
import pandas as pd
from glob import glob

## Single Charaster Wildcard: "?"

For instance, we can use a wildecard character like "?" to fetch all files starting with "A" of a ".txt" format.

In [7]:
glob("A?.TXT")

['AK.TXT', 'AL.TXT', 'AR.TXT', 'AZ.TXT']

## Zero or more Characters Wildcard: "*"

Or even fetch all files of a ".txt" format.

In [9]:
glob("*.TXT")

['AK.TXT',
 'AL.TXT',
 'AR.TXT',
 'AZ.TXT',
 'CA.TXT',
 'CO.TXT',
 'CT.TXT',
 'DC.TXT',
 'DE.TXT',
 'FL.TXT',
 'GA.TXT',
 'HI.TXT',
 'IA.TXT',
 'ID.TXT',
 'IL.TXT',
 'IN.TXT',
 'KS.TXT',
 'KY.TXT',
 'LA.TXT',
 'MA.TXT',
 'MD.TXT',
 'ME.TXT',
 'MI.TXT',
 'MN.TXT',
 'MO.TXT',
 'MS.TXT',
 'MT.TXT',
 'NC.TXT',
 'ND.TXT',
 'NE.TXT',
 'NH.TXT',
 'NJ.TXT',
 'NM.TXT',
 'NV.TXT',
 'NY.TXT',
 'OH.TXT',
 'OK.TXT',
 'OR.TXT',
 'PA.TXT',
 'RI.TXT',
 'SC.TXT',
 'SD.TXT',
 'TN.TXT',
 'TX.TXT',
 'UT.TXT',
 'VA.TXT',
 'VT.TXT',
 'WA.TXT',
 'WI.TXT',
 'WV.TXT',
 'WY.TXT']

Also, extend to a subdirectory file paths.

In [8]:
glob("subdir\\*.TXT")

['subdir\\yob1880.txt', 'subdir\\yob1881.txt']

Read in another text file.

In [10]:
pd.read_csv("subdir\\yob1880.txt")

           Mary  F  7065
0          Anna  F  2604
1          Emma  F  2003
2     Elizabeth  F  1939
3        Minnie  F  1746
4      Margaret  F  1578
...         ... ..   ...
1994     Woodie  M     5
1995     Worthy  M     5
1996     Wright  M     5
1997       York  M     5
1998  Zachariah  M     5

[1999 rows x 3 columns]

Let's collect all file names of a .txt format in the current working direcotry in a list.

In [11]:
filenames = glob("*.TXT")

In [12]:
filenames

['AK.TXT',
 'AL.TXT',
 'AR.TXT',
 'AZ.TXT',
 'CA.TXT',
 'CO.TXT',
 'CT.TXT',
 'DC.TXT',
 'DE.TXT',
 'FL.TXT',
 'GA.TXT',
 'HI.TXT',
 'IA.TXT',
 'ID.TXT',
 'IL.TXT',
 'IN.TXT',
 'KS.TXT',
 'KY.TXT',
 'LA.TXT',
 'MA.TXT',
 'MD.TXT',
 'ME.TXT',
 'MI.TXT',
 'MN.TXT',
 'MO.TXT',
 'MS.TXT',
 'MT.TXT',
 'NC.TXT',
 'ND.TXT',
 'NE.TXT',
 'NH.TXT',
 'NJ.TXT',
 'NM.TXT',
 'NV.TXT',
 'NY.TXT',
 'OH.TXT',
 'OK.TXT',
 'OR.TXT',
 'PA.TXT',
 'RI.TXT',
 'SC.TXT',
 'SD.TXT',
 'TN.TXT',
 'TX.TXT',
 'UT.TXT',
 'VA.TXT',
 'VT.TXT',
 'WA.TXT',
 'WI.TXT',
 'WV.TXT',
 'WY.TXT']

We have 51 files in total.

In [13]:
len(filenames)

51

# Importing & Merging many Files (complex case)

In [14]:
filenames

['AK.TXT',
 'AL.TXT',
 'AR.TXT',
 'AZ.TXT',
 'CA.TXT',
 'CO.TXT',
 'CT.TXT',
 'DC.TXT',
 'DE.TXT',
 'FL.TXT',
 'GA.TXT',
 'HI.TXT',
 'IA.TXT',
 'ID.TXT',
 'IL.TXT',
 'IN.TXT',
 'KS.TXT',
 'KY.TXT',
 'LA.TXT',
 'MA.TXT',
 'MD.TXT',
 'ME.TXT',
 'MI.TXT',
 'MN.TXT',
 'MO.TXT',
 'MS.TXT',
 'MT.TXT',
 'NC.TXT',
 'ND.TXT',
 'NE.TXT',
 'NH.TXT',
 'NJ.TXT',
 'NM.TXT',
 'NV.TXT',
 'NY.TXT',
 'OH.TXT',
 'OK.TXT',
 'OR.TXT',
 'PA.TXT',
 'RI.TXT',
 'SC.TXT',
 'SD.TXT',
 'TN.TXT',
 'TX.TXT',
 'UT.TXT',
 'VA.TXT',
 'VT.TXT',
 'WA.TXT',
 'WI.TXT',
 'WV.TXT',
 'WY.TXT']

Now that we have a list of all files we need, we want to open each one of them to get the table data and append it to a single table (dataframe) so that at the end we have a single file/table/dataframe containing all records.

In [15]:
dataframes = []
for name in filenames:
    df = pd.read_csv(name, header = None, names = ["State", "Gender", "Year", "Name", "Count"])
    dataframes.append(df)

In [16]:
dataframes

[      State Gender  Year      Name  Count
 0        AK      F  1910      Mary     14
 1        AK      F  1910     Annie     12
 2        AK      F  1910      Anna     10
 3        AK      F  1910  Margaret      8
 4        AK      F  1910     Helen      7
 ...     ...    ...   ...       ...    ...
 28523    AK      M  2018      Theo      5
 28524    AK      M  2018    Thorin      5
 28525    AK      M  2018   Trenton      5
 28526    AK      M  2018    Victor      5
 28527    AK      M  2018      Zion      5

 [28528 rows x 5 columns],
        State Gender  Year       Name  Count
 0         AL      F  1910       Mary    875
 1         AL      F  1910      Annie    482
 2         AL      F  1910     Willie    257
 3         AL      F  1910     Mattie    232
 4         AL      F  1910       Ruby    204
 ...      ...    ...   ...        ...    ...
 133860    AL      M  2018    Wallace      5
 133861    AL      M  2018     Westyn      5
 133862    AL      M  2018      Yazan      5
 133863    AL      M  2018     Yousef      5
 133864    AL      M  2018  Zechariah      5

 [133865 rows x 5 columns],
        State Gender  Year     Name  Count
 0         AR      F  1910     Mary    408
 1         AR      F  1910     Ruby    148
 2         AR      F  1910     Ruth    140
 3         AR      F  1910   Willie    132
 4         AR      F  1910    Ethel    109
 ...      ...    ...   ...      ...    ...
 101460    AR      M  2018   Watson      5
 101461    AR      M  2018   Wesson      5
 101462    AR      M  2018  Xzavier      5
 101463    AR      M  2018    Yahir      5
 101464    AR      M  2018    Yahya      5

 [101465 rows x 5 columns],
        State Gender  Year       Name  Count
 0         AZ      F  1910       Mary     74
 1         AZ      F  1910      Maria     29
 2         AZ      F  1910      Alice     27
 3         AZ      F  1910   Margaret     19
 4         AZ      F  1910      Helen     18
 ...      ...    ...   ...        ...    ...
 115365    AZ      M  2018       Yael      5
 115366    AZ      M  2018  Zacharias      5
 115367    AZ      M  2018     Zaidyn      5
 115368    AZ      M  2018       Zain      5
 115369    AZ      M  2018     Zavian      5

 [115370 rows x 5 columns],
        State Gender  Year      Name  Count
 0         CA      F  1910      Mary    295
 1         CA      F  1910     Helen    239
 2         CA      F  1910   Dorothy    220
 3         CA      F  1910  Margaret    163
 4         CA      F  1910   Frances    134
 ...      ...    ...   ...       ...    ...
 381209    CA      M  2018       Zed      5
 381210    CA      M  2018      Zein      5
 381211    CA      M  2018    Zhaire      5
 381212    CA      M  2018    Zidane      5
 381213    CA      M  2018    Zuriel      5

 [381214 rows x 5 columns],
        State Gender  Year       Name  Count
 0         CO      F  1910       Mary    193
 1         CO      F  1910      Helen    112
 2         CO      F  1910    Dorothy     87
 3         CO      F  1910       Ruth     68
 4         CO      F  1910   Margaret     67
 ...      ...    ...   ...        ...    ...
 107218    CO      M  2018    Westley      5
 107219    CO      M  2018     Westyn      5
 107220    CO      M  2018     Yariel      5
 107221    CO      M  2018     Zavian      5
 107222    CO      M  2018  Zechariah      5

 [107223 rows x 5 columns],
       State Gender  Year      Name  Count
 0        CT      F  1910      Mary    304
 1        CT      F  1910     Helen    170
 2        CT      F  1910      Anna    131
 3        CT      F  1910  Margaret     99
 4        CT      F  1910   Dorothy     90
 ...     ...    ...   ...       ...    ...
 81476    CT      M  2018      Wade      5
 81477    CT      M  2018    Yadiel      5
 81478    CT      M  2018     Zaire      5
 81479    CT      M  2018    Zander      5
 81480    CT      M  2018     Zayne      5

 [81481 rows x 5 columns],
       State Gender  Year       Name  Count
 0        DC      F  1910       Mary     80
 1        DC      F  1910   Margaret     72
 2        DC      F  1910      Helen     52
 3        DC      F  1910    Dorothy     50
 4        DC      F  1910  Elizabeth     34
 ...     ...    ...   ...        ...    ...
 55644    DC      M  2018       Noel      5
 55645    DC      M  2018     Sidney      5
 55646    DC      M  2018      Tyson      5
 55647    DC      M  2018      Zakai      5
 55648    DC      M  2018       Zane      5

 [55649 rows x 5 columns],
       State Gender  Year       Name  Count
 0        DE      F  1910       Mary     59
 1        DE      F  1910   Margaret     40
 2        DE      F  1910      Helen     37
 3        DE      F  1910  Elizabeth     27
 4        DE      F  1910       Anna     20
 ...     ...    ...   ...        ...    ...
 32308    DE      M  2018      Rocco      5
 32309    DE      M  2018      Rylan      5
 32310    DE      M  2018      Semaj      5
 32311    DE      M  2018     Steven      5
 32312    DE      M  2018     Thiago      5

 [32313 rows x 5 columns],
        State Gender  Year     Name  Count
 0         FL      F  1910     Mary    239
 1         FL      F  1910    Annie    101
 2         FL      F  1910    Ethel     82
 3         FL      F  1910   Willie     71
 4         FL      F  1910   Louise     70
 ...      ...    ...   ...      ...    ...
 205060    FL      M  2018  Zackery      5
 205061    FL      M  2018     Zael      5
 205062    FL      M  2018   Zamari      5
 205063    FL      M  2018    Ziggy      5
 205064    FL      M  2018     Zyir      5

 [205065 rows x 5 columns],
        State Gender  Year     Name  Count
 0         GA      F  1910     Mary    841
 1         GA      F  1910    Annie    553
 2         GA      F  1910   Mattie    320
 3         GA      F  1910     Ruby    279
 4         GA      F  1910   Willie    275
 ...      ...    ...   ...      ...    ...
 181658    GA      M  2018   Zacari      5
 181659    GA      M  2018  Zachery      5
 181660    GA      M  2018     Zack      5
 181661    GA      M  2018    Zyion      5
 181662    GA      M  2018     Zyir      5

 [181663 rows x 5 columns],
       State Gender  Year      Name  Count
 0        HI      F  1910      Mary     47
 1        HI      F  1910     Helen     20
 2        HI      F  1910     Alice     19
 3        HI      F  1910      Rose     18
 4        HI      F  1910    Violet     16
 ...     ...    ...   ...       ...    ...
 54447    HI      M  2018      Sean      5
 54448    HI      M  2018    Steven      5
 54449    HI      M  2018  Thaddeus      5
 54450    HI      M  2018    Tobias      5
 54451    HI      M  2018    Waylon      5

 [54452 rows x 5 columns],
       State Gender  Year     Name  Count
 0        IA      F  1910    Helen    249
 1        IA      F  1910     Mary    239
 2        IA      F  1910  Dorothy    185
 3        IA      F  1910  Mildred    162
 4        IA      F  1910     Ruth    155
 ...     ...    ...   ...      ...    ...
 93522    IA      M  2018   Trevor      5
 93523    IA      M  2018  Tristen      5
 93524    IA      M  2018      Van      5
 93525    IA      M  2018  Wallace      5
 93526    IA      M  2018   Witten      5

 [93527 rows x 5 columns],
       State Gender  Year       Name  Count
 0        ID      F  1910       Mary     53
 1        ID      F  1910    Dorothy     31
 2        ID      F  1910      Helen     30
 3        ID      F  1910   Margaret     24
 4        ID      F  1910       Ruth     24
 ...     ...    ...   ...        ...    ...
 57717    ID      M  2018     Sutton      5
 57718    ID      M  2018     Tayson      5
 57719    ID      M  2018   Thatcher      5
 57720    ID      M  2018     Wilder      5
 57721    ID      M  2018  Zachariah      5

 [57722 rows x 5 columns],
        State Gender  Year      Name  Count
 0         IL      F  1910      Mary   1076
 1         IL      F  1910     Helen    917
 2         IL      F  1910   Dorothy    553
 3         IL      F  1910  Margaret    501
 4         IL      F  1910   Mildred    426
 ...      ...    ...   ...       ...    ...
 228118    IL      M  2018    Yareth      5
 228119    IL      M  2018     Yuvan      5
 228120    IL      M  2018  Zamarion      5
 228121    IL      M  2018    Zarion      5
 228122    IL      M  2018    Zavion      5

 [228123 rows x 5 columns],
        State Gender  Year     Name  Count
 0         IN      F  1910     Mary    619
 1         IN      F  1910    Helen    324
 2         IN      F  1910     Ruth    238
 3         IN      F  1910  Dorothy    215
 4         IN      F  1910  Mildred    200
 ...      ...    ...   ...      ...    ...
 138565    IN      M  2018   Willis      5
 138566    IN      M  2018   Wilson      5
 138567    IN      M  2018  Xzavier      5
 138568    IN      M  2018   Yousef      5
 138569    IN      M  2018     Zaid      5

 [138570 rows x 5 columns],
       State Gender  Year       Name  Count
 0        KS      F  1910       Mary    251
 1        KS      F  1910      Helen    172
 2        KS      F  1910    Dorothy    144
 3        KS      F  1910       Ruth    144
 4        KS      F  1910    Mildred    127
 ...     ...    ...   ...        ...    ...
 93794    KS      M  2018      Tomas      5
 93795    KS      M  2018  Valentino      5
 93796    KS      M  2018       Whit      5
 93797    KS      M  2018       Zaid      5
 93798    KS      M  2018       Zain      5

 [93799 rows x 5 columns],
        State Gender  Year       Name  Count
 0         KY      F  1910       Mary    793
 1         KY      F  1910       Anna    199
 2         KY      F  1910  Elizabeth    191
 3         KY      F  1910   Margaret    175
 4         KY      F  1910       Edna    160
 ...      ...    ...   ...        ...    ...
 117829    KY      M  2018      Yasin      5
 117830    KY      M  2018     Yousef      5
 117831    KY      M  2018      Zaire      5
 117832    KY      M  2018     Zakari      5
 117833    KY      M  2018   Zeppelin      5

 [117834 rows x 5 columns],
        State Gender  Year     Name  Count
 0         LA      F  1910     Mary    586
 1         LA      F  1910    Annie    169
 2         LA      F  1910   Louise    157
 3         LA      F  1910    Marie    152
 4         LA      F  1910    Ethel    140
 ...      ...    ...   ...      ...    ...
 147963    LA      M  2018   Wilmer      5
 147964    LA      M  2018  Xzavier      5
 147965    LA      M  2018   Yousef      5
 147966    LA      M  2018    Zakai      5
 147967    LA      M  2018   Zavion      5

 [147968 rows x 5 columns],
        State Gender  Year      Name  Count
 0         MA      F  1910      Mary    989
 1         MA      F  1910     Helen    473
 2         MA      F  1910  Margaret    374
 3         MA      F  1910   Dorothy    331
 4         MA      F  1910     Alice    313
 ...      ...    ...   ...       ...    ...
 118057    MA      M  2018   Youssef      5
 118058    MA      M  2018    Zaidyn      5
 118059    MA      M  2018    Zavian      5
 118060    MA      M  2018   Zayvien      5
 118061    MA      M  2018    Zyaire      5

 [118062 rows x 5 columns],
        State Gender  Year       Name  Count
 0         MD      F  1910       Mary    393
 1         MD      F  1910   Margaret    208
 2         MD      F  1910      Helen    174
 3         MD      F  1910  Elizabeth    150
 4         MD      F  1910       Anna    131
 ...      ...    ...   ...        ...    ...
 110735    MD      M  2018       Yoel      5
 110736    MD      M  2018      Zakai      5
 110737    MD      M  2018     Zavier      5
 110738    MD      M  2018  Zechariah      5
 110739    MD      M  2018      Zymir      5

 [110740 rows x 5 columns],
       State Gender  Year      Name  Count
 0        ME      F  1910      Mary     92
 1        ME      F  1910     Helen     60
 2        ME      F  1910   Dorothy     55
 3        ME      F  1910      Ruth     51
 4        ME      F  1910  Margaret     49
 ...     ...    ...   ...       ...    ...
 50306    ME      M  2018    Salman      5
 50307    ME      M  2018     Simon      5
 50308    ME      M  2018    Tobias      5
 50309    ME      M  2018    Walker      5
 50310    ME      M  2018    Warren      5

 [50311 rows x 5 columns],
        State Gender  Year      Name  Count
 0         MI      F  1910     Helen    368
 1         MI      F  1910      Mary    349
 2         MI      F  1910  Margaret    272
 3         MI      F  1910   Dorothy    265
 4         MI      F  1910      Ruth    212
 ...      ...    ...   ...       ...    ...
 181877    MI      M  2018     Zaine      5
 181878    MI      M  2018     Zamir      5
 181879    MI      M  2018    Zavier      5
 181880    MI      M  2018     Ziggy      5
 181881    MI      M  2018     Zyion      5

 [181882 rows x 5 columns],
        State Gender  Year       Name  Count
 0         MN      F  1910       Mary    216
 1         MN      F  1910      Helen    201
 2         MN      F  1910   Margaret    184
 3         MN      F  1910    Dorothy    163
 4         MN      F  1910       Ruth    136
 ...      ...    ...   ...        ...    ...
 113587    MN      M  2018      Wylie      5
 113588    MN      M  2018     Zaiden      5
 113589    MN      M  2018   Zakariye      5
 113590    MN      M  2018       Zeke      5
 113591    MN      M  2018  Zephaniah      5

 [113592 rows x 5 columns],
        State Gender  Year     Name  Count
 0         MO      F  1910     Mary    611
 1         MO      F  1910    Helen    313
 2         MO      F  1910  Dorothy    270
 3         MO      F  1910  Mildred    267
 4         MO      F  1910     Ruth    237
 ...      ...    ...   ...      ...    ...
 137835    MO      M  2018    Yahya      5
 137836    MO      M  2018    Zakai      5
 137837    MO      M  2018   Zakari      5
 137838    MO      M  2018  Zebulun      5
 137839    MO      M  2018    Zyler      5

 [137840 rows x 5 columns],
        State Gender  Year    Name  Count
 0         MS      F  1910    Mary    762
 1         MS      F  1910   Annie    354
 2         MS      F  1910  Willie    208
 3         MS      F  1910  Mattie    178
 4         MS      F  1910  Lillie    158
 ...      ...    ...   ...     ...    ...
 113523    MS      M  2018  Tyrone      5
 113524    MS      M  2018  Westin      5
 113525    MS      M  2018  Westyn      5
 113526    MS      M  2018  Wilson      5
 113527    MS      M  2018  Zaylen      5

 [113528 rows x 5 columns],
       State Gender  Year       Name  Count
 0        MT      F  1910       Mary     81
 1        MT      F  1910      Helen     58
 2        MT      F  1910   Margaret     51
 3        MT      F  1910    Dorothy     41
 4        MT      F  1910  Elizabeth     22
 ...     ...    ...   ...        ...    ...
 45640    MT      M  2018         Ty      5
 45641    MT      M  2018      Uriah      5
 45642    MT      M  2018  Zachariah      5
 45643    MT      M  2018     Zander      5
 45644    MT      M  2018       Zeke      5

 [45645 rows x 5 columns],
        State Gender  Year       Name  Count
 0         NC      F  1910       Mary    837
 1         NC      F  1910      Annie    401
 2         NC      F  1910       Ruth    235
 3         NC      F  1910      Ethel    199
 4         NC      F  1910  Elizabeth    191
 ...      ...    ...   ...        ...    ...
 172535    NC      M  2018     Yuvaan      5
 172536    NC      M  2018      Yuvan      5
 172537    NC      M  2018      Zahir      5
 172538    NC      M  2018     Zaidyn      5
 172539    NC      M  2018     Zephyr      5

 [172540 rows x 5 columns],
       State Gender  Year      Name  Count
 0        ND      F  1910      Mary     85
 1        ND      F  1910     Alice     61
 2        ND      F  1910  Margaret     61
 3        ND      F  1910     Helen     59
 4        ND      F  1910      Anna     58
 ...     ...    ...   ...       ...    ...
 46064    ND      M  2018    Watson      5
 46065    ND      M  2018     Wells      5
 46066    ND      M  2018      Will      5
 46067    ND      M  2018    Zayden      5
 46068    ND      M  2018      Zion      5

 [46069 rows x 5 columns],
       State Gender  Year      Name  Count
 0        NE      F  1910      Mary    161
 1        NE      F  1910     Helen    134
 2        NE      F  1910      Ruth    114
 3        NE      F  1910   Dorothy     99
 4        NE      F  1910  Margaret     96
 ...     ...    ...   ...       ...    ...
 71655    NE      M  2018    Thorin      5
 71656    NE      M  2018    Travis      5
 71657    NE      M  2018      Trey      5
 71658    NE      M  2018    Zaiden      5
 71659    NE      M  2018      Zeke      5

 [71660 rows x 5 columns],
       State Gender  Year     Name  Count
 0        NH      F  1910     Mary     50
 1        NH      F  1910  Dorothy     39
 2        NH      F  1910    Alice     35
 3        NH      F  1910    Helen     30
 4        NH      F  1910  Lillian     29
 ...     ...    ...   ...      ...    ...
 38989    NH      M  2018   Trevor      5
 38990    NH      M  2018     Wade      5
 38991    NH      M  2018   Waylon      5
 38992    NH      M  2018   Xander      5
 38993    NH      M  2018    Yusuf      5

 [38994 rows x 5 columns],
        State Gender  Year       Name  Count
 0         NJ      F  1910       Mary    593
 1         NJ      F  1910      Helen    438
 2         NJ      F  1910       Anna    355
 3         NJ      F  1910   Margaret    311
 4         NJ      F  1910  Elizabeth    260
 ...      ...    ...   ...        ...    ...
 152115    NJ      M  2018     Yeshua      5
 152116    NJ      M  2018      Yunus      5
 152117    NJ      M  2018       Zack      5
 152118    NJ      M  2018     Zakari      5
 152119    NJ      M  2018        Zvi      5

 [152120 rows x 5 columns],
       State Gender  Year       Name  Count
 0        NM      F  1910       Mary     98
 1        NM      F  1910      Maria     40
 2        NM      F  1910   Margaret     38
 3        NM      F  1910  Josephine     35
 4        NM      F  1910      Helen     26
 ...     ...    ...   ...        ...    ...
 75233    NM      M  2018     Thiago      5
 75234    NM      M  2018     Trevor      5
 75235    NM      M  2018       Wade      5
 75236    NM      M  2018     Walter      5
 75237    NM      M  2018     Zander      5

 [75238 rows x 5 columns],
       State Gender  Year      Name  Count
 0        NV      F  1910      Mary     10
 1        NV      F  1910   Mildred      6
 2        NV      F  1910      Emma      5
 3        NV      F  1910     Helen      5
 4        NV      F  1911  Margaret      8
 ...     ...    ...   ...       ...    ...
 47201    NV      M  2018       Van      5
 47202    NV      M  2018   Vicente      5
 47203    NV      M  2018      Yael      5
 47204    NV      M  2018     Yahir      5
 47205    NV      M  2018     Zaire      5

 [47206 rows x 5 columns],
        State Gender  Year      Name  Count
 0         NY      F  1910      Mary   1923
 1         NY      F  1910     Helen   1290
 2         NY      F  1910      Rose    990
 3         NY      F  1910      Anna    951
 4         NY      F  1910  Margaret    926
 ...      ...    ...   ...       ...    ...
 296194    NY      M  2018    Zaidyn      5
 296195    NY      M  2018     Zidan      5
 296196    NY      M  2018    Zuhair      5
 296197    NY      M  2018       Zvi      5
 296198    NY      M  2018     Zyair      5

 [296199 rows x 5 columns],
        State Gender  Year      Name  Count
 0         OH      F  1910      Mary   1099
 1         OH      F  1910     Helen    698
 2         OH      F  1910   Dorothy    487
 3         OH      F  1910      Ruth    457
 4         OH      F  1910  Margaret    452
 ...      ...    ...   ...       ...    ...
 194667    OH      M  2018     Yunus      5
 194668    OH      M  2018   Zakaria      5
 194669    OH      M  2018    Zavion      5
 194670    OH      M  2018    Zaydon      5
 194671    OH      M  2018    Ziaire      5

 [194672 rows x 5 columns],
        State Gender  Year       Name  Count
 0         OK      F  1910       Mary    326

We are concatenating all individual tables to a single table/dataframe which results in 6028151 rows and 5 columns.

In [17]:
df = pd.concat(dataframes, ignore_index = True)

In [18]:
df

        State Gender  Year      Name  Count
0          AK      F  1910      Mary     14
1          AK      F  1910     Annie     12
2          AK      F  1910      Anna     10
3          AK      F  1910  Margaret      8
4          AK      F  1910     Helen      7
...       ...    ...   ...       ...    ...
6028146    WY      M  2018    Peyton      5
6028147    WY      M  2018   Richard      5
6028148    WY      M  2018     Titus      5
6028149    WY      M  2018   Tristan      5
6028150    WY      M  2018    Zander      5

[6028151 rows x 5 columns]

In [19]:
df.info(0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028151 entries, 0 to 6028150
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   State   object
 1   Gender  object
 2   Year    int64
 3   Name    object
 4   Count   int64
dtypes: int64(2), object(3)
memory usage: 230.0+ MB

Let's write the single table/dataframe to a single CSV file.

In [20]:
df.to_csv("baby_names_state.csv", index = False)

Let's read in the new file to make sure it's working.

In [21]:
pd.read_csv("baby_names_state.csv")

        State Gender  Year      Name  Count
0          AK      F  1910      Mary     14
1          AK      F  1910     Annie     12
2          AK      F  1910      Anna     10
3          AK      F  1910  Margaret      8
4          AK      F  1910     Helen      7
...       ...    ...   ...       ...    ...
6028146    WY      M  2018    Peyton      5
6028147    WY      M  2018   Richard      5
6028148    WY      M  2018     Titus      5
6028149    WY      M  2018   Tristan      5
6028150    WY      M  2018    Zander      5

[6028151 rows x 5 columns]

# Saving Memory - Categorical Feature

To save memory we can convert the columns "State" and "Gender" to categorical which reduces the memory by ~80MB.

In [22]:
df

        State Gender  Year      Name  Count
0          AK      F  1910      Mary     14
1          AK      F  1910     Annie     12
2          AK      F  1910      Anna     10
3          AK      F  1910  Margaret      8
4          AK      F  1910     Helen      7
...       ...    ...   ...       ...    ...
6028146    WY      M  2018    Peyton      5
6028147    WY      M  2018   Richard      5
6028148    WY      M  2018     Titus      5
6028149    WY      M  2018   Tristan      5
6028150    WY      M  2018    Zander      5

[6028151 rows x 5 columns]

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028151 entries, 0 to 6028150
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   State   object
 1   Gender  object
 2   Year    int64
 3   Name    object
 4   Count   int64
dtypes: int64(2), object(3)
memory usage: 230.0+ MB

In [24]:
df.nunique()

State        51
Gender        2
Year        109
Name      31595
Count      4929
dtype: int64

In [25]:
df.Gender = df.Gender.astype("category")
df.State = df.State.astype("category")

In [26]:
df.Gender

0          F
1          F
2          F
3          F
4          F
          ..
6028146    M
6028147    M
6028148    M
6028149    M
6028150    M
Name: Gender, Length: 6028151, dtype: category
Categories (2, object): ['F', 'M']

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028151 entries, 0 to 6028150
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   State   category
 1   Gender  category
 2   Year    int64
 3   Name    object
 4   Count   int64
dtypes: category(2), int64(2), object(1)
memory usage: 149.5+ MB